#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Fri Apr 14 15:15:18 2023

set_arch -family Logos -device PGL22G -speedgrade -6 -package FBG256
compile -top_module m1_soc_top
add_design C:/Users/86152/Desktop/rtl_design/pnr/ipcore/DDR3_50H/DDR3_50H.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
remove_design -force C:/Users/YHX/Desktop/rtl_design/pnr/ipcore/DDR3/DDR3.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module axi1_wr_test
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/cmos_8_16bit.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/fram_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/hdmi_ddr_ov5640_top_20230413215821.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/i2c_com.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/iic_dri.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/ms7200_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/ms7210_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/ms7210_ctl_20230413215822.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/ms72xx_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/ov5640_ddr.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/power_on_delay.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/rd_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/rd_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/reg_config.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/sync_vg.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/wr_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/wr_cmd_trans.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/wr_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/wr_rd_ctrl_top.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/wr_rd_ctrl_top_20230413215822.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module axi1_wr_test
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/axi1_wr_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
add_design "C:/Users/86152/Desktop/rtl_design/pnr/source/wr_fram_buf/wr_fram_buf.idf"
add_design "C:/Users/86152/Desktop/rtl_design/pnr/source/rd_fram_buf/rd_fram_buf.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/hdmi_ddr_ov5640_top_20230413215821.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/cmos_8_16bit.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/fram_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/hdmi_ddr_ov5640_top.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/hdmi_ddr_ov5640_top_20230413215821.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/i2c_com.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/iic_dri.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/ms7200_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/ms7210_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/ms7210_ctl_20230413215822.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/ms72xx_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/power_on_delay.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/rd_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/rd_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/reg_config.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/sync_vg.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_cmd_trans.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_rd_ctrl_top.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_rd_ctrl_top_20230413215822.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/hdmi_ddr.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/hdmi_ddr_ov5640_top_20230413215821.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/hdmi_ddr_ov5640_top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/ms7210_ctl_20230413215822.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_rd_ctrl_top_20230413215822.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ms7200_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ms7210_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ms7210_ctl_20230413215822.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/fram_buf.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ms72xx_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/rd_buf.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/rd_ctrl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/sync_vg.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/wr_buf.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/wr_cmd_trans.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/wr_ctrl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/wr_rd_ctrl_top.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/wr_rd_ctrl_top_20230413215822.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/cmos_8_16bit.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/wr_rd_ctrl_top.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/wr_ctrl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/wr_cmd_trans.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/sync_vg.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/reg_config.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/rd_ctrl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/wr_buf.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/fram_buf.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/power_on_delay.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/rd_buf.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/i2c_com.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/iic_dri.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ov5640_ddr.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/hdmi_ddr.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms7200_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms7210_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/iic_dri.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/iic_dri.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms72xx_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/power_on_delay.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/reg_config.v"
remove_design C:/Users/86152/Desktop/rtl_design720/pnr/ipcore/TEST_RAM/TEST_RAM.idf
add_design "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ov5640_ddr.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/i2c_com.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/iic_dri.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/power_on_delay.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/reg_config.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/hdmi_ddr.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/iic_dri.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms72xx_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms7200_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms7210_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/ddr_hdmi.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/fram_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/rd_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/rd_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/sync_vg.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/wr_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/wr_cmd_trans.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/wr_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/wr_rd_ctrl_top.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/iic_dri.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/i2c_com.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
add_design "C:/Users/86152/Desktop/rtl_design_V1.2/src/ddr_hdmi/wr_buf_1.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.2/src/ddr_hdmi/wr_buf_2.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.2/src/ddr_hdmi/wr_buf_3.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.2/src/ddr_hdmi/wr_buf_4.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design_V1.2/src/ddr_hdmi/wr_buf.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/camera_delay.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/cmos_select.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/i2c_master/i2c_config.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/i2c_master/i2c_master_bit_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/i2c_master/i2c_master_byte_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/i2c_master/i2c_master_top.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/lut_ov5640_rgb565_800_600.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/arp_cache.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/crc.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/dpram.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/icmp_reply.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/mac_test.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/mac_top.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/rx/arp_rx.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/rx/ip_rx.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/rx/mac_rx.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/rx/mac_rx_top.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/rx/udp_rx.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/tx/arp_tx.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/tx/ip_tx.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/tx/ip_tx_mode.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/tx/mac_tx.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/tx/mac_tx_mode.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/tx/mac_tx_top.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/mac/tx/udp_tx.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/power_on_rst.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/reset.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/new/video_ethernet.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.3/src/eth_video/src/util_gmii_to_rgmii.v"
add_design C:/Users/86152/Desktop/rtl_design_V1.3/pnr/ipcore/camera_fifo/camera_fifo.idf
add_design C:/Users/86152/Desktop/rtl_design_V1.3/pnr/ipcore/pll_sft/pll_sft.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
add_design "C:/Users/86152/Desktop/rtl_design_V1.6/src/hsst_ddr/hsst_ddr.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.6/pnr/source/hsst_fifo/hsst_fifo.idf"
add_design "C:/Users/86152/Desktop/rtl_design_V1.6/pnr/source/u_hsst/u_hsst.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
add_fic "C:/Users/86152/Desktop/rtl_design_V1.6/pnr/synthesize/m1_soc_top_syn.fic"
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
remove_fic -force"C:/Users/86152/Desktop/rtl_design_V1.6/pnr/synthesize/m1_soc_top_syn.fic"
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
add_fic "C:/Users/86152/Desktop/rtl_design_V1.6/pnr/synthesize/m1_soc_top_syn.fic"
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
remove_fic "C:/Users/86152/Desktop/rtl_design_V1.6/pnr/synthesize/m1_soc_top_syn.fic"
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
add_design C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/u_pcie.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/src/ddr_pice/video_pcie.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
remove_design -force -verilog "C:/Users/86152/Desktop/rtl_design_V1.7/src/eth_video/new/i2c_master/i2c_config.v"
remove_design -force -verilog "C:/Users/86152/Desktop/rtl_design_V1.7/src/eth_video/new/i2c_master/i2c_master_top.v"
remove_design -force -verilog "C:/Users/86152/Desktop/rtl_design_V1.7/src/eth_video/new/i2c_master/i2c_master_byte_ctrl.v"
remove_design -force -verilog "C:/Users/86152/Desktop/rtl_design_V1.7/src/eth_video/new/i2c_master/i2c_master_bit_ctrl.v"
remove_design -force -verilog "C:/Users/86152/Desktop/rtl_design_V1.7/src/eth_video/new/lut_ov5640_rgb565_800_600.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/fifo/ipm_distributed_sdpram_v1_2_distributed_fifo.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/fifo/pgs_pciex4_fifo_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/fifo/pgs_pciex4_fifo_v1_2.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipm_distributed_sdpram_v1_2.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_controller.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_cpld_tx_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_mrd_tx_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_mwr_tx_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_ram/ipsl_pcie_dma_ram.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_ram/rtl/ipml_sdpram_v1_5_ipsl_pcie_dma_ram.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_rd_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_rx_cpld_wr_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_rx_mwr_wr_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_rx_top.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_tlp_rcv.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_tlp_tx_mux.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_tx_cpld_rd_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_tx_mwr_rd_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_tx_top.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_dma_wr_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/ipsl_pcie_reg.v"
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/u_pcie/example_design/rtl/ipsl_pcie_dma_ctrl/pgs_pciex4_prefetch_fifo_v1_2.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
add_design C:/Users/86152/Desktop/rtl_design_V1.7/pnr/ipcore/pcie_fifo/pcie_fifo.idf
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/source/pcie_fifo/pcie_fifo.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
add_fic "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/synthesize/m1_soc_top_syn.fic"
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
remove_fic -force"C:/Users/86152/Desktop/rtl_design_V1.7/pnr/synthesize/m1_soc_top_syn.fic"
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
add_design "C:/Users/86152/Desktop/rtl_design_V1.7/pnr/source/u_hsst/example_design/rtl/u_hsst_src.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
add_design "C:/Users/YHX/Desktop/rtl_design_V1.8/pnr/source/source/uart_data_gen.v"
add_design "C:/Users/YHX/Desktop/rtl_design_V1.8/pnr/source/source/uart_rx.v"
add_design "C:/Users/YHX/Desktop/rtl_design_V1.8/pnr/source/source/uart_tx.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
remove_design -force -verilog "C:/Users/86152/Desktop/rtl_design_V1.9.1/pnr/source/u_hsst/example_design/rtl/u_hsst_src.v"
remove_design -force -verilog "C:/Users/86152/Desktop/rtl_design_V1.9.1/src/udp_hw_speedup/udp_hw_speedup.vp"
remove_design -force -verilog "C:/Users/86152/Desktop/rtl_design_V1.9.1/src/tsmac_phy/tsmac_phy.v"
remove_design -force C:/Users/86152/Desktop/rtl_design_V1.9.1/pnr/ipcore/TSMAC_FIFO_RXCKLI/TSMAC_FIFO_RXCKLI.idf
remove_design -force -verilog "C:/Users/86152/Desktop/rtl_design_V1.9.1/src/eth_video/new/cmos_select.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
add_fic "C:/Users/YHX/Desktop/rtl_design_V1.9.1/pnr/synthesize/m1_soc_top_syn.fic"
dev_map -detail -devmap_remove_dups 1 
dev_map -detail -devmap_remove_dups 1 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
dev_map -detail -devmap_remove_dups 1 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
remove_fic -force"C:/Users/86152/Desktop/rtl_design_V1.9.1_18v_hsst/pnr/synthesize/m1_soc_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
